Revit 2024 API
IFCExportOptions.FilterViewId Property
 Id of the view whose visibility settings will govern the contents in the exported IFC file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ElementId FilterViewId { get; set; }
Visual Basic
Public Property FilterViewId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ FilterViewId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Field Value
 This should be set to the id of the view, or InvalidElementId if there is to be no special filtering applied (all model elements will be exported). Default is InvalidElementId.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
IFCExportOptions Class
Autodesk.Revit.DB Namespace